Revit 2027 API
View.UnhideElements Method
Sets the elements to be shown in the given view if they are currently hidden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UnhideElements(
	ICollection<ElementId> elementIdSet
)
Public Sub UnhideElements (
	elementIdSet As ICollection(Of ElementId)
)
public:
void UnhideElements(
	ICollection<ElementId^>^ elementIdSet
)
member UnhideElements :
        elementIdSet : ICollection<ElementId> -> unit
Parameters
elementIdSet ICollection<ElementId>
A set of ElementIds to be unhidden.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when argument is null.
ArgumentException | Thrown when the set of elements to be unhidden is empty or one of the elements can not be unhidden.
InvalidOperationException | Thrown when document regeneration failed.
Remarks
This change is permanent until the elements are hidden again. All elements in the set must be currently hidden. An application can check this with IsHidden(View).
See Also
Reference
View Class
Autodesk.Revit.DB Namespace